Revit 2027 API
ExternalServices.BuiltInExternalServices.EntitlementExternalService Property
 The external service which supports get entitlement information.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId EntitlementExternalService { get; }
Public Shared ReadOnly Property EntitlementExternalService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ EntitlementExternalService {
	ExternalServiceId^ get ();
}
static member EntitlementExternalService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace